---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecMains
source: html/562d4e5a-c80f-f1e8-4896-3235b815c5f7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecMains Property

"Mains"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecMains { get; }
```